# Werkcollege-opdrachten Week 1.3

## Dependencies importeren

Kopieer in het codeblok hieronder van het vorige practicum de import-code voor de dependencies die het vaakst worden gebruikt om data in te lezen. Geef er ook de gebruikelijke aliassen aan.<br>
Zet eventuele warnings uit.

In [1]:
import pandas as pd
import sqlite3 as sqlite
import warnings

warnings.simplefilter('ignore')

Zet het bestand go_sales_train.sqlite in een makkelijk te vinden map

## Databasetabellen inlezen

Kopieer in het codeblok hieronder van het vorige practicum de code om een connectie met het bestand go_sales_train.sqlite te maken.

In [2]:
sqliteConnection = sqlite.connect('.\\sqlite\\go_sales_train.sqlite')
cursor = sqliteConnection.cursor()

Lees van de ingelezen go_sales_train-database te volgende tabellen in met behulp van "SELECT * FROM *tabel*".
- product
- product_type
- product_line
- sales_staff
- sales_branch
- retailer_site
- country
- order_header
- order_details
- returned_item
- return_reason

In [3]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
cursor.execute(sql_query)
tables = cursor.fetchall()
for table in tables:
    table_name = table[0]
    df = pd.read_sql(f"SELECT * FROM {table_name}", sqliteConnection)
    print({table_name})
    print(df)

{'country'}
    COUNTRY_CODE         COUNTRY LANGUAGE CURRENCY_NAME
0              1          France       EN        francs
1              2         Germany       EN         marks
2              3   United States       EN       dollars
3              4          Canada       EN       dollars
4              5         Austria       EN    schillings
5              6           Italy       EN          lira
6              7     Netherlands       EN      guilders
7              8     Switzerland       EN        francs
8              9  United Kingdom       EN        pounds
9             10          Sweden       EN         krona
10            11           Japan       EN           yen
11            12          Taiwan       EN    new dollar
12            13           Korea       EN           won
13            14           China       EN      renminbi
14            16       Australia       EN       dollars
15            17         Belgium       EN        francs
16            18         Denmark       EN        kroner
17            19           Spain       EN       pesetas
18            20          Mexico       EN         pesos
19            21          Brazil       EN         reals
20            22         Finland       EN        markka
{'order_details'}
       ORDER_DETAIL_CODE  ORDER_NUMBER  PRODUCT_NUMBER  QUANTITY  UNIT_COST  \
0                  47737          1638               1        84       4.38
1                  47738          1159               1       126       4.38
2                  47739          1171               1       122       4.38
3                  47740          1154               1       122       4.38
4                  47741          1205               1       272       4.38
...                  ...           ...             ...       ...        ...
37752             115289          7631             112        70       6.00
37753             115290          7627             113        44       6.00
37754             115291          7630             114         8      80.00
37755             115292          7631             115        24       5.00
37756             115293          7627             115        56       5.00

       UNIT_PRICE  UNIT_SALE_PRICE
0            6.59             6.59
1            6.59             6.59
2            6.59             6.03
3            6.59             6.59
4            6.59             5.26
...           ...              ...
37752        9.00             9.00
37753       12.00             9.00
37754      200.00           140.00
37755       10.00            10.00
37756       10.00             7.50

[37757 rows x 7 columns]
{'order_header'}
      ORDER_NUMBER RETAILER_NAME  RETAILER_SITE_CODE  RETAILER_CONTACT_CODE  \
0             1153  Ultra Sports                   4                      6
1             1154  Ultra Sports                   4                      6
2             1155  Ultra Sports                   5                     65
3             1156  Ultra Sports                   5                     65
4             1157  Ultra Sports                   6                     66
...            ...           ...                 ...                    ...
4779          9475  Preben's T°y                 338                    329
4780          9476  Preben's T°y                 336                    327
4781          9477  Preben's T°y                 338                    329
4782          9478  Preben's T°y                 336                    327
4783          9479  Preben's T°y                 338                    329

      SALES_STAFF_CODE  SALES_BRANCH_CODE  ORDER_DATE  ORDER_METHOD_CODE
0                   50                 18  2022-04-14                  7
1                   50                 18  2022-10-01                  4
2                   49                 18  2022-04-21                  7
3                   49                 18  2022-09-09                  5
4                   50                 18  2022-04-10                  2
...                ...                ...         ...                ...
4779                29                 15  2022-01-13                  4
4780                29                 15  2023-01-02                  5
4781                29                 15  2023-01-18                  2
4782                27                 15  2024-01-15                  7
4783                27                 15  2024-02-02                  5

[4784 rows x 8 columns]
{'order_method'}
   ORDER_METHOD_CODE ORDER_METHOD_EN
0                  1             Fax
1                  2       Telephone
2                  3            Mail
3                  4          E-mail
4                  5             Web
5                  7     Sales visit
6                  8         Special
{'product'}
     PRODUCT_NUMBER INTRODUCTION_DATE  PRODUCT_TYPE_CODE  PRODUCTION_COST  \
0                 1        1995-02-15                  1             4.00
1                 2        1995-02-15                  1             9.22
2                 3        1995-02-15                  1            15.93
3                 4        1995-02-15                  1             5.00
4                 5        1995-02-15                  1            34.97
..              ...               ...                ...              ...
110             111        2003-12-15                 20            81.80
111             112        2004-01-10                 21             6.00
112             113        2004-01-15                 21             6.00
113             114        2003-12-15                 21            80.00
114             115        2003-12-27                 21             5.00

     MARGIN    PRODUCT_IMAGE LANGUAGE                 PRODUCT_NAME  \
0      0.33    P01CE1CG1.jpg       EN          TrailChef Water Bag
1      0.23    P02CE1CG1.jpg       EN            TrailChef Canteen
2      0.28    P03CE1CG1.jpg       EN        TrailChef Kitchen Kit
3      0.28    P04CE1CG1.jpg       EN                TrailChef Cup
4      0.30    P05CE1CG1.jpg       EN           TrailChef Cook Set
..      ...              ...      ...                          ...
110    0.55  P111GE5PT20.jpg       EN        Blue Steel Max Putter
111    0.33  P112GE5GA21.jpg       EN  Course Pro Golf and Tee Set
112    0.50  P113GE5GA21.jpg       EN          Course Pro Umbrella
113    0.60  P114GE5GA21.jpg       EN          Course Pro Golf Bag
114    0.50  P115GE5GA21.jpg       EN            Course Pro Gloves

                                           DESCRIPTION
0    Lightweight, collapsible bag to carry liquids ...
1    Aluminum canteen. Rugged fleece-lined cover wi...
2    Zippered nylon pouch contains cutlery for two,...
3              Tin cup. Holds 0.4 liters. Weight: 60 g
4    All you will ever need on the trail.  Pot grip...
..                                                 ...
110  Putter head is composed from a single piece of...
111  Set includes two premium golf ball and an asso...
112       Large red and white patterned golf umbrella.
113  High quality golf bag that includes carrying s...
114  Durable nylon constructed gloves with stitched...

[115 rows x 9 columns]
{'product_line'}
   PRODUCT_LINE_CODE           PRODUCT_LINE_EN
0                  1         Camping Equipment
1                  2  Mountaineering Equipment
2                  3      Personal Accessories
3                  4        Outdoor Protection
4                  5            Golf Equipment
{'product_type'}
    PRODUCT_TYPE_CODE  PRODUCT_LINE_CODE       PRODUCT_TYPE_EN
0                   1                  1          Cooking Gear
1                   2                  1                 Tents
2                   3                  1         Sleeping Bags
3                   4                  1                 Packs
4                   5                  1              Lanterns
5                   6                  2                  Rope
6                   7                  2                Safety
7                   8                  2  Climbing Accessories
8                   9                  2                 Tools
9                  10                  3               Watches
10                 11                  3               Eyewear
11                 12                  3                Knives
12                 13                  3            Binoculars
13                 14                  3            Navigation
14                 15                  4     Insect Repellents
15                 16                  4             Sunscreen
16                 17                  4             First Aid
17                 18                  5                 Irons
18                 19                  5                 Woods
19                 20                  5               Putters
20                 21                  5      Golf Accessories
{'retailer_site'}
     RETAILER_SITE_CODE  RETAILER_CODE            ADDRESS1 ADDRESS2  \
0                     1             89  1117 Franklin Blvd     None
1                     2             89     45, rue Atwater     None
2                     3             89    328 Hodgson Road     None
3                     4             90      2425, rue Peel     None
4                     5             90       34 8th Avenue     None
..                  ...            ...                 ...      ...
386                 439            209     Hüttenstraße 87     None
387                 440            209      Hauptstraße 85     None
388                 441            209          Amselweg 8     None
389                 442            209       Hasengasse 38     None
390                 443            210     Hammerstraße 26     None

               CITY         REGION POSTAL_ZONE  COUNTRY_CODE  ACTIVE_INDICATOR
0          Winnipeg       Manitoba     R2C 0M5             4                 1
1          Montréal         Québec     H2T 9K8             4                 1
2       Fredericton  New Brunswick     E3B 2H2             4                 1
3          Montréal         Québec     H4G 3T4             4                 1
4           Sudbury        Ontario     M5V 1G5             4                 1
..              ...            ...         ...           ...               ...
386  Klosterneuburg           None      A-3400             5                 1
387            Linz           None      A-4015             5                 1
388       Innsbruck           None      A-6020             5                 1
389          Ischgl           None      A-6561             5                 1
390       Innsbruck           None      A-6020             5                 1

[391 rows x 9 columns]
{'return_reason'}
   RETURN_REASON_CODE   RETURN_DESCRIPTION_EN
0                   1       Defective product
1                   2      Incomplete product
2                   3   Wrong product ordered
3                   4   Wrong product shipped
4                   5  Unsatisfactory product
{'returned_item'}
     RETURN_CODE          RETURN_DATE  ORDER_DETAIL_CODE  RETURN_REASON_CODE  \
0           1491  Aug  1 2023  4:10AM              84858                   5
1           1492  Dec  6 2022  6:46PM              84440                   2
2           1493  Jun 24 2023  9:23AM              84867                   4
3           1494  Jul 21 2023 12:00AM              84873                   3
4           1496  Oct  7 2022  5:13AM              84488                   1
..           ...                  ...                ...                 ...
614         2464  Dec  7 2023  5:14AM             114967                   1
615         2465  Jun  6 2023  9:22AM             114972                   3
616         2466  Oct  6 2023 12:31PM             114983                   5
617         2467  Mar 31 2024  3:39PM             115215                   4
618         2469  Sep 25 2022 10:56PM             114848                   3

     RETURN_QUANTITY
0                  8
1                  2
2                 22
3                 20
4                  2
..               ...
614               12
615               24
616               66
617               64
618               82

[619 rows x 5 columns]
{'sales_branch'}
    SALES_BRANCH_CODE                          ADDRESS1           ADDRESS2  \
0                   6     75, rue du Faubourg St-Honoré               None
1                   7                   Piazza Duomo, 1               None
2                   9               Singelgravenplein 4      4e verdieping
3                  13                    Schwabentor 35               None
4                  14                  Leopoldstraße 36               None
5                  15               Isafjordsgatan 30 C               None
6                  17      7800, 756 - 6th Avenue. S.W.               None
7                  18                  789 Yonge Street               None
8                  19            1288 Dorchester Avenue               None
9                  20                   299 Yale Avenue               None
10                 21        1288 South Barrington Ave.               None
11                 22                    10032 NW 186th               None
12                 23               6c, rue de l'Église               None
13                 24  Prol. Paseo de la Reforma No. 51  Lomas de Santa Fe
14                 25               202-2-3 Hyakunincho        Shinjuku-ku
15                 26                     543-225 Asahi           Asahi-ku
16                 28                  2315 Queen's Ave            Level 2
17                 29     Plaza de la Constitución, s/n               None
18                 30             Avenida Paulista, 333   CJ 231 2o. Andar
19                 31                     Kauppakatu 33               None
20                 32             234-12, Kongdeok-Dong            Mapo-Ku
21                 33      154, Choung-Cheng South Road               None
22                 34          No. 1277 Beijing Xi Road               None
23                 35                    Victoria House    25 Ebury Street
24                 36                    3 Albany Court      Market Street
25                 37                    Birchstraße 13               None
26                 38                 Interleuvenlaan 2               None
27                 39                 Jedleser Straße 7               None

                CITY         REGION POSTAL_ZONE  COUNTRY_CODE
0              Paris           None     F-75008             1
1             Milano           None     I-20121             6
2          Amsterdam  Noord-Holland     1233 BW             7
3            Hamburg           None     D-22529             2
4            München           None     D-81241             2
5              Kista           None    S-164 40            10
6            Calgary        Alberta     T2P 3Z0             4
7            Toronto        Ontario     M2M 4K8             4
8             Boston  Massachusetts       02133             3
9            Seattle     Washington       98139             3
10       Los Angeles     California       90072             3
11             Miami        Florida       33024             3
12              Lyon           None     F-69002             1
13  Distrito Federal         México       01219            20
14             Tokyo          Tokyo    681-3187            11
15        Osaka City          Osaka    616-5698            11
16         Melbourne            VIC        2088            16
17            Bilbao        Vizcaya       48223            19
18         São Paulo             SP   01403-090            21
19            Kuopio           None   FIN-73100            22
20             Seoul           None     121-020            13
21         San Chung         Taipei         241            12
22          Shanghai           None      200040            14
23            London           None     N17 7LX             9
24        Birmingham  West Midlands     B43 7NP             9
25            Zürich           None     CH-8057             8
26          Heverlee           None      B-3001            17
27              Wien           None      A-1210             5
{'sales_staff'}
     SALES_STAFF_CODE FIRST_NAME  LAST_NAME                   POSITION_EN  \
0                   4      Denis       Pagé                Branch Manager
1                   5  Élizabeth     Michel  Level 3 Sales Representative
2                   6      Émile   Clermont  Level 1 Sales Representative
3                   7    Étienne     Jauvin  Level 2 Sales Representative
4                  12    Elsbeth  Wiesinger  Level 2 Sales Representative
..                ...        ...        ...                           ...
97                120      Giele   Laermans  Level 1 Sales Representative
98                121   François    De Crée  Level 1 Sales Representative
99                122     Yvette    Lattrez  Level 3 Sales Representative
100               123      Willi  Seefelder  Level 2 Sales Representative
101               124     Sabine     Grüner  Level 3 Sales Representative

            WORK_PHONE  EXTENSION                FAX                   EMAIL  \
0    +33 1 68 94 52 20      325.0  +33 1 68 94 56 60       DPage@grtd123.com
1    +33 1 68 94 52 20      336.0  +33 1 68 94 56 60     EMichel@grtd123.com
2    +33 1 68 94 52 20      378.0  +33 1 68 94 56 60   EClermont@grtd123.com
3    +33 1 68 94 52 20      398.0  +33 1 68 94 56 60     EJauvin@grtd123.com
4    +(49) 40 663 1990     1818.0  +(49) 40 663 4571  EWiesinger@grtd123.com
..                 ...        ...                ...                     ...
97     +32 16 20.73.21     1340.0    +32 16 20.73.32   GLaermans@grtd123.com
98     +32 16 20.73.21     1642.0    +32 16 20.73.32     FDecree@grtd123.com
99     +32 16 20.73.21     1633.0    +32 16 20.73.32    YLattrez@grtd123.com
100  +(43) 13 79 56 32      325.0  +(43) 13 79 56 33  WSeefelder@grtd123.com
101  +(43) 13 79 56 32      348.0  +(43) 13 79 56 33     SGruner@grtd123.com

     DATE_HIRED  SALES_BRANCH_CODE
0    1996-11-03                  6
1    1995-06-08                  6
2    1998-04-07                  6
3    1997-08-16                  6
4    1997-02-27                 13
..          ...                ...
97   1999-11-15                 38
98   1999-12-01                 38
99   1999-12-09                 38
100  1998-10-28                 39
101  1998-02-18                 39

[102 rows x 10 columns]

Krijg je een "no such table" error? Dan heb je misschien met .connect() per ongeluk een leeg  databasebestand (.sqlite) aangemaakt. <u>Let op:</u> lees eventueel de informatie uit het Notebook van werkcollege 1.1b nog eens goed door.

Als je tijdens onderstaande opdrachten uit het oog verliest welke tabellen er allemaal zijn, kan je deze Pythoncode uitvoeren:

In [4]:
sql_query = "SELECT name FROM sqlite_master WHERE type='table';"
#Vul dit codeblok verder in
pd.read_sql(sql_query, sqliteConnection)
#Op de puntjes hoort de connectie naar go_sales_train óf go_staff_train óf go_crm_train te staan.

             name
0         country
1   order_details
2    order_header
3    order_method
4         product
5    product_line
6    product_type
7   retailer_site
8   return_reason
9   returned_item
10   sales_branch
11    sales_staff

erachter

Let op! Voor alle onderstaande opdrachten mag je <u>alleen Python</u> gebruiken, <u>geen SQL!</u>

## Selecties op één tabel zonder functies

Geef een overzicht met daarin de producten en hun productiekosten waarvan de productiekosten lager dan 100 dollar en hoger dan 50 dollar ligt. (2 kolommen, 23 rijen)

In [5]:
df = pd.read_sql("SELECT * FROM product", sqliteConnection)
df_res = df.loc[(df['PRODUCTION_COST'] > 50) & (df['PRODUCTION_COST'] < 100), ['PRODUCT_NAME', 'PRODUCTION_COST']]
print(df_res)

                        PRODUCT_NAME  PRODUCTION_COST
5          TrailChef Deluxe Cook Set            85.11
7             TrailChef Double Flame            75.00
16                   Hibernator Lite            60.00
17                        Hibernator            86.00
19   Hibernator Self - Inflating Mat            78.55
22               Hibernator Camp Cot            65.33
23      Canyon Mule Climber Backpack            62.50
45           Granite Climbing Helmet            52.86
47             Husky Harness Extreme            55.00
57                    Granite Hammer            57.13
68                         Polar Ice            73.33
69                      Polar Sports            80.00
70                        Polar Wave            60.00
71                     Polar Extreme            72.50
74                      Edge Extreme            80.00
77                         Seeker 35            79.19
78                         Seeker 50            92.58
79                    Seeker Extreme            94.12
82                    Glacier Deluxe            56.25
83                       Glacier GPS            78.55
109                Blue Steel Putter            60.00
110            Blue Steel Max Putter            81.80
113              Course Pro Golf Bag            80.00

Geef een overzicht met daarin de producten en hun marge waarvan de marge lager dan 20 % of hoger dan 60 % ligt. (2 kolommen, 7 rijen)

In [6]:
df = pd.read_sql("SELECT * FROM product", sqliteConnection)
df_res = df.loc[(df['MARGIN'] < 0.20) | (df['MARGIN'] > 0.60), ['PRODUCT_NAME', 'MARGIN']]
print(df_res)

                    PRODUCT_NAME  MARGIN
20                Hibernator Pad    0.17
23  Canyon Mule Climber Backpack    0.17
85             BugShield Natural    0.67
86               BugShield Spray    0.67
87         BugShield Lotion Lite    0.70
88              BugShield Lotion    0.63
89             BugShield Extreme    0.63

Geef een overzicht met daarin de landen waar met francs wordt betaald. Sorteer de uitkomst op land.  (1 kolom, 3 rijen)

In [7]:
df = pd.read_sql("SELECT * FROM country", sqliteConnection)
df_res = df.loc[(df['CURRENCY_NAME'] == 'francs'), ['COUNTRY']]
print(df_res)

        COUNTRY
0        France
7   Switzerland
15      Belgium

Geef een overzicht met daarin de verschillende introductiedatums waarop producten met meer dan 50% marge worden geïntroduceerd (1 kolom, 7 rijen)

In [8]:
df = pd.read_sql("SELECT * FROM product", sqliteConnection)
df_res = df.loc[(df['MARGIN'] > 0.50), ['INTRODUCTION_DATE']]
df_res_unique = df_res['INTRODUCTION_DATE'].drop_duplicates()
print(df_res_unique)

66     2000-10-26
85     1995-02-15
101    2003-12-10
103    2003-12-18
104    2003-12-27
106    2004-01-13
110    2003-12-15
Name: INTRODUCTION_DATE, dtype: object

Geef een overzicht met daarin het eerste adres en de stad van verkoopafdelingen waarvan zowel het tweede adres als de regio bekend is (2 kolommen, 7 rijen)

In [9]:
df = pd.read_sql("SELECT * FROM sales_branch", sqliteConnection)
df_res = df.loc[(df['ADDRESS2'].notna()) & (df['REGION'].notna()), ['ADDRESS1', 'CITY']]
print(df_res)

                            ADDRESS1              CITY
2                Singelgravenplein 4         Amsterdam
13  Prol. Paseo de la Reforma No. 51  Distrito Federal
14               202-2-3 Hyakunincho             Tokyo
15                     543-225 Asahi        Osaka City
16                  2315 Queen's Ave         Melbourne
18             Avenida Paulista, 333         São Paulo
24                    3 Albany Court        Birmingham

Geef een overzicht met daarin de landen waar met dollars (dollars of new dollar) wordt betaald. Sorteer de uitkomst op land. (1 kolom, 4 rijen)

In [11]:
df = pd.read_sql("SELECT * FROM country", sqliteConnection)
df_res = df.loc[(df['CURRENCY_NAME'] == 'dollars') | (df['CURRENCY_NAME'] == 'new dollar'), ['COUNTRY']]
print(df_res)

          COUNTRY
2   United States
3          Canada
11         Taiwan
14      Australia

Geef een overzicht met daarin beide adressen en de stad van vestigingen van klanten waarvan de postcode begint met een ‘D’ (van duitsland). Filter op vestigingen die een tweede adres hebben. (3 kolommen, 2 rijen)

In [17]:
df = pd.read_sql("SELECT * FROM retailer_site", sqliteConnection)
df_res = df.loc[(df['POSTAL_ZONE'].str.startswith('D')) & (df['ADDRESS2'].notna()), ['ADDRESS1', 'ADDRESS2', 'CITY']]
print(df_res)

            ADDRESS1       ADDRESS2       CITY
31  Röntgenstraße 90  3. Tür rechts  Frankfurt
59   Grubesallee 141       4. Stock    Hamburg

## Selecties op één tabel met functies

Geef het totaal aantal producten dat is teruggebracht (1 waarde)

In [ ]:
df = pd.read_sql("SELECT * FROM returned_item", sqliteConnection)
df_res = df.shape[0]
print(df_res)

619

Geef het aantal regio’s waarin verkoopafdelingen gevestigd zijn. (1 waarde)

In [ ]:
df = pd.read_sql("SELECT * FROM sales_branch", sqliteConnection)
df_res = df['REGION'].nunique()
print(df_res)

15

Maak 3 variabelen:
- Een met de laagste
- Een met de hoogste
- Een met de gemiddelde (afgerond op 2 decimalen)

marge van producten (3 kolommen, 1 rij)

In [64]:
df = pd.read_sql("SELECT * FROM product", sqliteConnection)

laagste = df['MARGIN'].min()
hoogste = df['MARGIN'].max()
gem = round(df['MARGIN'].mean(), 2)

print(laagste)
print(hoogste)
print(gem)

0.17
0.7
0.4

Geef het aantal vestigingen van klanten waarvan het 2e adres niet bekend is (1 waarde)

In [62]:
df = pd.read_sql("SELECT * FROM sales_branch", sqliteConnection)

df_res = df['ADDRESS2'].isna().sum()
print(df_res)

19

Geef de gemiddelde kostprijs van de verkochte producten waarop korting (unit_sale_price < unit_price) is verleend (1 waarde)

In [60]:
df = pd.read_sql("SELECT * FROM order_details", sqliteConnection)

df_disc = df[df['UNIT_SALE_PRICE'] < df['UNIT_PRICE']]
avg_price = round(df_disc['UNIT_PRICE'].mean(), 2)

print(avg_price)

204.99

Geef een overzicht met daarin het aantal medewerkers per medewerkersfunctie (2 kolommen, 7 rijen)

In [58]:
df = pd.read_sql("SELECT * FROM sales_staff", sqliteConnection)

df_res = df.groupby('POSITION_EN', as_index=False)['SALES_STAFF_CODE'].count()
df_res

                    POSITION_EN  SALES_STAFF_CODE
0                Branch Manager                19
1              District Manager                 4
2               General Manager                 1
3  Level 1 Sales Representative                13
4  Level 2 Sales Representative                39
5  Level 3 Sales Representative                24
6              Regional Manager                 2

Geef een overzicht met daarin per telefoonnummer het aantal medewerkers dat op dat telefoonnummer bereikbaar is. Toon alleen de telefoonnummer waarop meer dan 4 medewerkers bereikbaar zijn. (2 kolommen, 10 rijen)

In [57]:
df = pd.read_sql("SELECT * FROM sales_staff", sqliteConnection)

df_res = df.groupby('WORK_PHONE', as_index=False)['SALES_STAFF_CODE'].count()
df_res_filter = df_res[df_res['SALES_STAFF_CODE'] > 4]
df_res_filter

             WORK_PHONE  SALES_STAFF_CODE
4     +(44) 121 3505267                 5
10  +(61) 03 2982  4242                 5
11  +31 (0)20 692 93 94                 5
13    +33 1 68 94 52 20                 5
18     1 (206) 292-0012                 5
19     1 (305) 557-4810                 6
20     1 (310) 281-5722                 5
21     1 (403) 232-5986                 5
22     1 (416) 493-5595                 5
23     1 (617) 268-6754                 6

## Selecties op meerdere tabellen zonder functies

Geef een overzicht met daarin het eerste adres en de stad van vestigingen van klanten uit ‘Netherlands’ (2 kolommen, 20 rijen)

In [55]:
retailer = pd.read_sql("SELECT * FROM retailer_site", sqliteConnection)
country = pd.read_sql("SELECT * FROM country", sqliteConnection)

df_merge = pd.merge(retailer, country, left_on='COUNTRY_CODE', right_on='COUNTRY_CODE', how='left')
df_nl = df_merge['COUNTRY'] == 'Netherlands'
df_merge.loc[(df_nl), ['ADDRESS1', 'CITY']]

                      ADDRESS1          CITY
240                   Beets 36         Beets
241               Perestraat 1      Deventer
242  Laan van Meerdervoort 966      Den Haag
243             Kalfjeslaan 47    Amstelveen
244               Startbaan 11    Amstelveen
245      Noorderspoorsingel 28     Groningen
246              Hogehilweg 13     Amsterdam
247             Spoorstraat 43    Varsseveld
248             Westhavenweg 8     Amsterdam
249              Westzeedijk 4        Muiden
250            Gooiergracht 91         Laren
251            Hoofdstraat 150   Pieterburen
252                Olde Diek 2         Laren
253     Amsterdamsestraatweg 8      Maarssen
254        Krayenhoffstraat 11     Amsterdam
255         Overschiestraat 19     Amsterdam
256              Havenbuurt 12        Marken
257               Duivendaal 1    Wageningen
258              Voorstraat 37  Nieuweschans
259         Stadhouderslaan 18     Rotterdam

Geef een overzicht met daarin de productnamen die tot het producttype ‘Eyewear’ behoren. (1 kolom, 5 rijen)

In [70]:
product = pd.read_sql("SELECT * FROM product", sqliteConnection)
type = pd.read_sql("SELECT * FROM product_type", sqliteConnection)

df_merge = pd.merge(product, type, left_on='PRODUCT_TYPE_CODE', right_on='PRODUCT_TYPE_CODE', how='left')
df_nl = df_merge['PRODUCT_TYPE_EN'] == 'Eyewear'
df_merge.loc[(df_nl), ['PRODUCT_NAME']]

     PRODUCT_NAME
67      Polar Sun
68      Polar Ice
69   Polar Sports
70     Polar Wave
71  Polar Extreme

Geef een overzicht met daarin alle unieke eerste adressen van klantvestigingen en de voornaam en achternaam van de verkopers die ‘Branch Manager’ zijn en aan deze vestigingen hebben verkocht (3 kolommen, 1 rij)

In [75]:
sales_staff = pd.read_sql("SELECT * FROM sales_staff", sqliteConnection)
sales_branch = pd.read_sql("SELECT * FROM sales_branch", sqliteConnection)
order_header = pd.read_sql("SELECT * FROM order_header", sqliteConnection)

df_merge = pd.merge(sales_branch, order_header, left_on='SALES_BRANCH_CODE', right_on='SALES_BRANCH_CODE')
df_merge2 = pd.merge(df_merge, sales_staff, left_on='SALES_STAFF_CODE', right_on='SALES_STAFF_CODE')

df_filter = df_merge2[df_merge2['POSITION_EN'] == 'Branch Manager']
df_res = df_filter[['ADDRESS1', 'FIRST_NAME', 'LAST_NAME']].drop_duplicates()
df_res

                   ADDRESS1 FIRST_NAME LAST_NAME
3737  Avenida Paulista, 333     Bayard     Lopes

Geef een overzicht met daarin van de verkopers hun functie en indien zij iets hebben verkocht de datum waarop de verkoop heeft plaatsgevonden. Laat alleen de verschillende namen van de posities zien van de verkopers die het woord ‘Manager’ in hun positienaam hebben staan. (2 kolommen, 7 rijen)

In [99]:
sales_staff = pd.read_sql("SELECT * FROM sales_staff", sqliteConnection)
order_header = pd.read_sql("SELECT * FROM order_header", sqliteConnection)

df_merge = pd.merge(order_header, sales_staff, left_on='SALES_STAFF_CODE', right_on='SALES_STAFF_CODE', how='right')

df_filter = df_merge[df_merge['POSITION_EN'].str.contains('Manager', case=False, na=False)]

df_res = df_filter[['POSITION_EN', 'ORDER_DATE']].drop_duplicates()
df_res

           POSITION_EN  ORDER_DATE
0       Branch Manager         NaN
320   Regional Manager         NaN
648   District Manager         NaN
3748    Branch Manager  2024-09-09
3749    Branch Manager  2024-03-13
3750    Branch Manager  2024-01-09
4186   General Manager         NaN

Geef een overzicht met daarin de verschillende namen van producten en bijbehorende namen van producttypen van de producten waarvoor ooit meer dan 750 stuks tegelijk verkocht zijn. (2 kolommen, 9 rijen)

In [ ]:
product = pd.read_sql("SELECT * FROM product", sqliteConnection)
type = pd.read_sql("SELECT * FROM product_type", sqliteConnection)

df_merge = pd.merge(product, type, left_on='SALES_STAFF_CODE', right_on='SALES_STAFF_CODE')

df_filter = df_merge[df_merge['POSITION_EN'].str.contains('Manager', case=False, na=False)]

df_res = df_filter[['POSITION_EN', 'ORDER_DATE']].drop_duplicates()
df_res

Geef een overzicht met daarin de productnamen waarvan ooit meer dan 40% korting is verleend. De formule voor korting is: (unit_price - unit_sale_price) / unit_price (1 kolom, 8 rijen)

Geef een overzicht met daarin de retourreden van producten waarvan ooit meer dan 90% van de aangeschafte hoeveelheid is teruggebracht (return_quantity/quantity). (1 kolom, 3 rijen)

## Selecties op meerdere tabellen met functies

Geef een overzicht met daarin per producttype het aantal producten die tot dat producttype behoren. (2 kolommen, 21 rijen)

Geef een overzicht met daarin per land het aantal vestigingen van klanten die zich in dat land bevinden. (2 kolommen, 21 rijen)

Geef een overzicht met daarin van de producten behorend tot het producttype ‘Cooking Gear’ per productnaam de totaal verkochte hoeveelheid en de gemiddelde verkoopprijs. Sorteer de uitkomst op totaal verkochte hoeveelheid. (4 kolommen, 10 rijen)

Geef een overzicht met daarin per land de naam van het land, de naam van de stad waar de verkoopafdeling is gevestigd (noem de kolomnaam in het overzicht ‘verkoper’) en het aantal steden waar zich klanten bevinden in dat land (noem de kolomnaam in het overzicht ‘klanten’) (3 kolommen, 29 rijen)

## Pythonvertalingen van SUBSELECT en UNION met o.a. for-loops

Geef een overzicht met daarin de voornaam en de achternaam van de medewerkers die nog nooit wat hebben verkocht (2 kolommen, 25 rijen)

Geef een overzicht met daarin het aantal producten waarvan de marge lager is dan de gemiddelde marge van alle producten samen. Geef in het overzicht tevens aan wat de gemiddelde marge is van dit aantal producten waarvan de marge lager dan de gemiddelde marge van alle producten samen is. (1 kolom, 2 rijen)

Geef een overzicht met daarin de namen van de producten die voor meer dan 500 (verkoopprijs) zijn verkocht maar nooit zijn teruggebracht. (1 kolom, 13 rijen)

Geef een overzicht met daarin per (achternaam van) medewerker of hij/zij manager is of niet, door deze informatie toe te voegen als extra 'Ja/Nee'-kolom.<br>
Hint: gebruik een for-loop waarin je o.a. bepaalt of het woord 'Manager' in de functie (position_en) staat. (2 kolommen, 102 rijen).

Met de onderstaande code laat je Python het huidige jaar uitrekenen.

In [ ]:
from datetime import date
date.today().year

2024

Met de onderstaande code selecteer je op een bepaald jaartal uit een datum.

In [ ]:
from datetime import datetime

date_str = '16-8-2013'
date_format = '%d-%m-%Y'
date_obj = datetime.strptime(date_str, date_format)

date_obj.year

2013

Geef met behulp van bovenstaande hulpcode een overzicht met daarin op basis van het aantal jaar dat iemand in dienst is of een medewerker ‘kort in dienst’ (minder dan 25 jaar in dienst) of een ‘lang in dienst’ (groter gelijk dan 12 jaar in dienst) is. Geef daarbij per medewerker in een aparte kolom zowel ‘kort in dienst’ als ‘lang in dienst’ aan. Gebruik (wederom) een for-loop.<br>
(2 kolommen, 102 rijen)

## Van Jupyter Notebook naar Pythonproject

1. Richt de map waarin jullie tot nu toe hebben gewerkt in volgens de mappenstructuur uit de slides.
2. Maak van de ontstane mappenstructuur een Pythonproject dat uitvoerbaar is vanuit de terminal. Maak daarin een .py-bestand dat minstens 5 antwoorden uit dit notebook (in de vorm van een DataFrame) exporteert naar Excelbestanden. Alle notebooks mogen als notebook blijven bestaan.
3. Zorg ervoor dat dit Pythonproject zijn eigen repo heeft op Github. Let op: je virtual environment moet <b><u>niet</u></b> meegaan naar Github.

Je mag tijdens dit proces je uit stap 1 ontstane mappenstructuur aanpassen, zolang je bij het beoordelingsmoment kan verantwoorden wat de motivatie hierachter is. De slides verplichten je dus nergens toe.